import pdfplumber
import pandas as pd
from os import getcwd,system, makedirs, listdir, removedirs,remove

import warnings
warnings.filterwarnings('ignore')

class  Pdf2Excel:

    InPath = ""
    OutPath = ""
    fileName=""
    filePath = ""
    table=[]

    def readpdf(self):
        #print('============读取pdf文件列表==============') #读取pdf文件地址
        self.InPath = ""
        self.InPath = getcwd()
        #print(self.InPath)
        self.InPath = self.InPath + '\\input'
        #print(self.InPath)
        return self.InPath

    def analysis(self, fileName):
        self.fileName=fileName
        self.filePath = self.InPath+'\\'+fileName
        print(self.filePath)
        with pdfplumber.open(self.filePath) as pdf:
            print('==============分析pdf================')
            print("")
            i=1
            for page in pdf.pages:
                print("第%s页 "%i,end="")

                if i%10==0:
                    print("")

                tableTmp = page.extract_tables()
                # print(tableTmp)
                i += 1

                try:
                    self.table.extend(tableTmp[0])
                except:
                    pass

            print("")
            pdf.close_file()
            remove(self.filePath)


    def save2pdf(self):

        self.outPath = getcwd()
        #print(self.outPath)
        #print(self.fileName)
        self.outPath = self.outPath + "\\output\\"+self.fileName.replace("pdf", "xlsx").replace("PDF", "xlsx")

        output = pd.DataFrame(self.table)
        #print(self.outPath)
        output.to_excel(self.outPath)

        lingQianChongZhi = 0
        lingQianTiXian = 0

        try:

            if output[0][1] == '支付宝账户':
                print("")
                print("支付宝钱包%s  总收入是：%s，总支出是：%s" % (output[2][2], output[2][3], output[2][5]))
                print("")
            else:
                time = output[1][0]
                data = output[3:]
                data[[5]] = data[[5]].apply(pd.to_numeric)

                if "其他" in list(data[3]):

                    bb = data[(data[3] == "其他")][[2, 5]].groupby(by=2).sum()
                    if "零钱充值" in list(bb.index):
                        lingQianChongZhi = bb[bb.index == '零钱充值'][5][0]


                    if "零钱提现" in list(bb.index):
                        lingQianTiXian = bb[bb.index == '零钱提现'][5][0]




                if (("收入" in list(data[3]))|(("支出" in list(data[3])))):

                    aa = data[[3, 5]].groupby(by=3).sum()
                    if "收入" in list(aa.index):
                        income = aa[aa.index == '收入'][5][0] + lingQianChongZhi
                    else:
                        income = lingQianChongZhi

                    if "支出" in list(aa.index):
                        outcome = aa[aa.index == '支出'][5][0] + lingQianTiXian
                    else:
                        outcome=lingQianTiXian
                else:
                    outcome=lingQianTiXian
                    income=lingQianChongZhi
               
                print("")
                print("微信钱包%s  总收入是：%s，总支出是：%s" % (time, income, outcome))
                print("")

        except:
            print("文件异常：请输入由微信或支付宝直接导出的流水pdf文件。")

        print("==============转化pdf==============")
        print("")
        print("输出文件保存于：%s" % self.outPath)
        self.table=[]




        #os.system("pause")



if __name__ == "__main__":
    print("")
    """
    print("0000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000")
    print("0000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000")
    print("0000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000")
    print("0000001  100001           000   000000000000000000000001           0    0000000001   001           0")
    print("000000    0000            000   00000000000000000000000            01    00000001   100            0")
    print("000000   10000   100000000000   00000000000000000000000   100000000000   1000001   0000   1000000000")
    print("000000   10000   100000000000   00000000000000000000000   1000000000001   10000   10000   1000000000")
    print("000000   10000   100000000000   00000000000000000000000   10000000000001   000   100000   1000000000")
    print("000000   10000   101111110000   00000000000000000000000   111111 10000001   0   1000000   111111 100")
    print("000000   10000           0000   00000000000000000000000           0000000      10000000           00")
    print("000000   10000   111111110000   00000000001        0000   1000101000000000     00000000   1000101000")
    print("000000   10000   100000000000   00000000000   1    0000   10000000000000000   000000000   1000000000")
    print("000000   10000   100000000000   00000000000000000000000   10000000000000000   000000000   1000000000")
    print("000001   00000   100000000000   00000000000000000000000   10000000000000000   000000000   1000000000")
    print("1       000000    00000000000            00000000000000            00000000   000000000            0")
    print("0     100000001  100000000000            000000000000001           00000000   0000000001           0")
    print("0000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000")
    print("0000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000")
    print("0000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000")
    """
    #print("0000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000")
   # print("0000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000")
   # print("0000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000")
    print("0000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000")
    print("0000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000")
    print("0000000000000   0000001       10000   000000000000000000000          000000000000000001          000000")
    print("0000000000000   00001   11111  0000   000000000000000000000   11     000000000000000001   1     1000000")
    print("0000000000000   0001  1000000000000   000000000000000000000  10000000000000000000000001  00000000000000")
    print("0000000000000  10001  0000000000000  1000000000000000000000   0000000001110000000011001  00000000000000")
    print("0000000000000   0000   100000000000   000000000000000000000  1000000000   0000000   001  00000000000000")
    print("0000000000000  1000001    100000000   000000000000000000000         1000   000001  0001         0000000")
    print("0000000000000   00000001     100000   000000000011111110000          0001  00000  00001         0000000")
    print("0000000000000   00000000001    0000  10000000001       0000  100000000000   000  100001  00000000000000")
    print("0000000000000   0000000000001  1000   000000000000000000000   000000000000  000  000001  00000000000000")
    print("0000000000000  10000000000000  1000  1000000000000000000000  10000000000001  0  1000001  00000000000000")
    print("000000001001   0000  1000001   0000   001111100000000000000   0011111000000     0000001  10111111000000")
    print("00000000     1000001         100000          10000000000000           000000   00000001          000000")
    print("0000000001110000000000011110000000000000000000000000000000000000000000000000  1000000000000000000000000")
    print("000000000000000000000000000000000000000000000000000000000000000000000000000   0000000000000000000000000")
    print("00000000000000000000000000000000000000000000000000000000000000000000000000   00000000000000000000000000")
    print("00000000000000000000000000000000000000000000000000000000000000000000000     000000000000000000000000000")
    print("0000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000")
    #print("0000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000")
    #print("0000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000")

    makedirs("input", exist_ok=True)
    print("")
    print("将文件放入input文件夹下")
    print("")
    system("pause")
    print("")
    print("===本程序共三步:读取，分析，转化===")
    print("")

    myPdf2Excel = Pdf2Excel()
    makedirs('output', exist_ok=True)
    j=1
    for fileName in listdir(myPdf2Excel.readpdf()):
        print("")
        print("")

        print("读取第%s份文件:%s文件"%(j,fileName))

        print("")
        myPdf2Excel.analysis(fileName)
        myPdf2Excel.save2pdf()
        j += 1

    removedirs("input")

    print("")
    print("=========请取走output中的文件==========")
    system("pause")
